# 导航距离（公里）
distances = {
    '香港': {
        '深圳': 30,
        '广州': 135,
        '东莞': 68,
        '佛山': 100,
        '惠州': 150,
        '珠海': 60,
        '澳门': 70,
        '江门': 140,
        '中山': 90,
        '肇庆': 180
    },
    '深圳': {
        '香港': 30,
        '广州': 110,
        '东莞': 50,
        '佛山': 80,
        '惠州': 120,
        '珠海': 100,
        '澳门': 110,
        '江门': 160,
        '中山': 80,
        '肇庆': 170
    },
    '广州': {
        '香港': 135,
        '深圳': 110,
        '东莞': 80,
        '佛山': 45,
        '惠州': 150,
        '珠海': 145,
        '澳门': 140,
        '江门': 100,
        '中山': 105,
        '肇庆': 180
    },
    '东莞': {
        '香港': 68,
        '深圳': 50,
        '广州': 80,
        '佛山': 55,
        '惠州': 90,
        '珠海': 90,
        '澳门': 100,
        '江门': 130,
        '中山': 40,
        '肇庆': 160
    },
    '佛山': {
        '香港': 100,
        '深圳': 80,
        '广州': 45,
        '东莞': 55,
        '惠州': 110,
        '珠海': 70,
        '澳门': 80,
        '江门': 60,
        '中山': 60,
        '肇庆': 125
    },
    '惠州': {
        '香港': 150,
        '深圳': 120,
        '广州': 150,
        '东莞': 90,
        '佛山': 110,
        '珠海': 140,
        '澳门': 150,
        '江门': 130,
        '中山': 100,
        '肇庆': 170
    },
    '珠海': {
        '香港': 60,
        '深圳': 100,
        '广州': 145,
        '东莞': 90,
        '佛山': 70,
        '惠州': 140,
        '澳门': 10,
        '江门': 90,
        '中山': 50,
        '肇庆': 150
    },
    '澳门': {
        '香港': 70,
        '深圳': 110,
        '广州': 140,
        '东莞': 100,
        '佛山': 80,
        '惠州': 150,
        '珠海': 10,
        '江门': 100,
        '中山': 60,
        '肇庆': 160
    },
    '江门': {
        '香港': 140,
        '深圳': 160,
        '广州': 100,
        '东莞': 130,
        '佛山': 60,
        '惠州': 130,
        '珠海': 90,
        '澳门': 100,
        '中山': 60,
        '肇庆': 90
    },
    '中山': {
        '香港': 90,
        '深圳': 80,
        '广州': 105,
        '东莞': 40,
        '佛山': 60,
        '惠州': 100,
        '珠海': 50,
        '澳门': 60,
        '江门': 60,
        '肇庆': 120
    },
    '肇庆': {
        '香港': 180,
        '深圳': 170,
        '广州': 180,
        '东莞': 160,
        '佛山': 125,
        '惠州': 170,
        '珠海': 150,
        '澳门': 160,
        '江门': 90,
        '中山': 120
    }
}
dis={}
# 转换为英里（miles）
for city1 in distances:
    for city2 in distances[city1]:
        distances[city1][city2] *= 0.621371
        dis[city1,city2]=distances[city1][city2]

# 示例输出所有城市之间的距离
